app/controllers/players_controller.rb

  def index
    render json: Player.all
---
SELECT "players".* FROM "players"

  def show
    render json: Player.all
---
SELECT "players".* FROM "players"

  def create
    character = @current_user.players.create!(player_params)
---
INSERT INTO "players" ("user_id", "character_name", "character_class", "character_race", "alignment", "STR", "CHA", "WIS", "CON", "DEX", "INT", "hit_points", "level", "hit_die", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"

  def update
      updated_player = Player.find_by(id: params[:id])
      updated_player.update(player_params)
---
SELECT "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "players" SET "hit_points" = $1, "level" = $2, "updated_at" = $3 WHERE "players"."id" = $4  [["hit_points", nil], ["level", 2], ["updated_at", "2022-03-31 20:04:11.542874"], ["id", 3]]