app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "`"], ["password_digest", "$2a$12$a8eqbu2yqxLx/eawmgukB.5iCWf2dog7W.EXGXkZ57QuCl.vqBjTa"], ["created_at", "2022-03-31 16:56:49.836929"], ["updated_at", "2022-03-31 16:56:49.836929"]]
---
  def create
    user = User.create!(user_params)